import  { useState } from 'react';
import { NavLink } from 'react-router-dom';

const Questions = () => {
	const [openBlocks, setOpenBlocks] = useState([]);

	const toggleBlock = index => {
		setOpenBlocks(prev =>
			prev.includes(index) ? prev.filter(i => i !== index) : [...prev, index]
		);
	};

	const questions = [
		{
			id: 0,
			question: 'Що в особистому кабінеті дитини на платформі?',
			answer: (
				<div className='mt-[60px]'>
					<p>
						<span className='font-bold'>TalkEn.Cloud</span> - це не просто
						платформа для навчання, це освітній простір для учнів, та ми з
						гордістю можемо сказати, що навчаючись на нашій платформі, це знак
						якості для батьків.
					</p>
					<p>
						На нашій платформі зібрані сучасні технологіі, освітня модель нового
						покоління та сервіс.
					</p>
					<div>
						<span className='font-bold list'>Для дитини:</span>
						<ul className='pl-[8px] sm:pl-[15px]'>
							<li className='flex items-start gap-3'>
								<span>•</span>
								всі матеріали, розклад, пропущені заняття, домашні завдання.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								сучасний підручник «24 Easy Steps» та «Notes», в яких легко
								працювати та отримувати задоволення від навчання.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								тести для перевірки знань та закріплення матеріалу.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								онлайн-тренажер Self Study.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								відслідковування успішності дитини.
							</li>
						</ul>
					</div>
					<div>
						<span className='font-bold list'>Для батьків:</span>
						<ul className='pl-[8px] sm:pl-[15px]'>
							<li className='flex items-start gap-3'>
								<span>•</span>
								контроль навчання дитини.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								можливість скасування уроку, зміни графіку, реєстроація на
								додаткові події.
							</li>
							<li className='flex items-start gap-3'>
								<span>•</span>
								договір оферти, оплата послуг, анонси подій, корисні статті.
							</li>
						</ul>
					</div>
				</div>
			),
		},
		{
			id: 1,
			question: 'Що це за методика "Age + Level"?',
			answer: (
				<div className='mt-[60px]'>
					<p>
						В онлайн школи англійської мови{' '}
						<span className='font-bold'>«StartSpeakEn» </span>
						принципом формування груп є методика вік дитини + рівень англійської
						+ ціль навчання. Цей підхід дозволяє максимально створити комфортні
						умови для ефективного навчання англійської мови.
					</p>
				</div>
			),
		},
		{
			id: 2,
			question: 'Модель «Flipped classroom» що означає «Перевернутий урок»?',
			answer: (
				<div className='mt-[60px]'>
					<p>
						Цю модель практикують багато шкіл у всьому світі.{' '}
						<span className='font-bold'>Flipped classroom</span> — це модель
						навчання, де традиційний урок «перевертається», тобто змінюється
						теоритичний матеріал з практичною частиною+ дитина переглядає урок
						до початку уроку. Така методика дозволяє дитині відчувати себе більш
						впевненою на уроці тому що матеріал для неї не новий, далі іде
						закріплення прочитаного чи проглянутого матеріалу.
					</p>
				</div>
			),
		},
		{
			id: 3,
			question:
				'Який розклад занять на онлайн курсах англійської мови «StartSpeakEn?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						Розклад залежить від групи, рівня та віку дитини, тому ви можете
						дізнатись після тесту, або спитати загальну інформацію у нашого
						адміністратора. Контакти у розділі «Контакти».
					</p>
					<p>P.S. В з’язку з віключенням світла графік може змінюватись.</p>
				</div>
			),
		},
		{
			id: 4,
			question:
				'Чи компенсує пропущені уроки онлайн школа англійської мови «StartSpeakEn»?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						Пропущені заняття на ці теми можна відпрацювати в іншій групі
						безкоштовно, якщо таких груп не має, пропонуємо взяти уроки
						індивідуально по 40 хв. , вартість 500 грн. 1 урок.
					</p>
					<p>
						P.S. Якщо форс-мажор (вімкненя світла, технічні проблеми з нашого
						боку), всі уроки відпрацювуються{' '}
						<span className='font-bold'>безкоштовно</span>.
					</p>
				</div>
			),
		},
		{
			id: 5,
			question: 'Хто ваші викладачі і чи є у вас ліцензія?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						Онлайн школа англійської мови{' '}
						<span className='font-bold'>«StartSpeakEn»</span> надає послуги
						позашкільного навчання, такий від навчання не підлягає ліцензуванню.
					</p>
					<p>
						Всі наші вчителі проходять особливий відбір не тільки на знання мови
						та вимови, але і на бажання працювати з дітьми, на терплячість та
						бажання допомагати дитині оволодіти мовою та заговорити без
						сором’язлівості.
					</p>
				</div>
			),
		},
		{
			id: 6,
			question:
				'Якщо тест показав нижчий рівень, ніж нам потрібно, то чи можна записатися в іншу групу?',
			answer: (
				<div className='mt-[60px]'>
					<p>
						В онлайн школі англійської мови{' '}
						<span className='font-bold'>«StartSpeakEn»</span> процес визначення
						рівня відбувається спочатку з онлайн тесту( лінк на тест), потім на
						першому пробному занятті вчитель по унікальниму веркторному принципу
						«Age+Level» більш детальніше придивлюється до рівня учня і тількі
						після цього вирішує в якій групі для комфортного навчання буде
						краще. Якщо вчитель не побачить підстав для переведення в іншу групу
						нижчого чи вижчого рівня, то такий перехід буде не можливим.
					</p>
				</div>
			),
		},
		{
			id: 7,
			question: 'Як оплатити онлайн курси англійської мови ?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						В онлайн школі англійської мови{' '}
						<span className='font-bold'>«StartSpeakEn»</span> оплата за начання
						відбувається тільки безготівковим способом на банкіський рахунок.
					</p>
					<p className='mb-5'>
						Ви можете оплатити в гривні, в евро та доларах, на рахунок Приват
						банку, Монобанку. Якщо вам треба оплатити у валюті, спитайте рахунок
						у нашого адміністратора у розділі «Контакти» або оплатіть на
						европейський рахунок або на український. Перейти до оплати.
					</p>
					<p className='mb-5'>
						Оплата здійснюється двома платежами, перший це передоплата 1000 грн.
						бронювання місця в групі, та решта суми вноситься протягом 5 днів
						після пробного заняття.
					</p>
					<p className='mb-5'>
						Якщо так сталось, що ви вирішили після пробного заняття не
						продовжувати навчання в нашій школі, то повертаються кошти з
						вирахуванням 350 грн. за проведений урок
					</p>
					<p className='mb-5'>
						У випадку коли учень оплатив все навчання, але вирішив призупинити
						уроки, в такому випадку не передбачено повернення чи заморожування
						грошей. Про ці умови детальніше написано в{' '}
						<NavLink className='text-[#A032C7] font-medium' to='/pay'>
							дороворі публічної аферти.
						</NavLink>
					</p>
					<p className='mb-5'>
						P.S. Обов’язково надішліть квитанцію на пошту, в темі листа вкажіть
						імя та прізвище вашої дитини.
					</p>
				</div>
			),
		},
		{
			id: 8,
			question: 'Чи можлива помісячна оплата?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						Оплата здійснюється двома платежами, перший це передоплата 1000 грн.
						бронювання місця в групі, та решта суми вноситься протягом 5 днів
						після пробного заняття.
					</p>
					<p>
						Але, є вийнятки коли ми можемо розбити платіж на 3 платежі, це 1-й
						платіж -1000 грн. бронювання в групі, другий +40% після пробного
						уроку на протязі 3-х днів, і 3-й платіж +50% решта ще через 7-10
						днів, тобто всі 3 платежі будуть проплачені за 2 неділи від початку
						курсу. Поясніть вашу ситуацію адміністратору у розділі «Контакти»,
						він передасть менеджеру який приймає рішення.
					</p>
				</div>
			),
		},
		{
			id: 9,
			question: 'Хто власник онлайн школи англійської мови «StartSpeakEn»?',
			answer: (
				<div className='mt-[60px]'>
					<p className='mb-5'>
						Привіт ! Якщо ти це читаєш , це означає що тобі не байдуже де буде
						вчитись твоя дитина, мабуть тобі цікаво хто ці люди які все це
						організовують та роблять світ розумнішим. Мене звати Аліна , я
						говорю на 6- ти мовах та ще планую вивчити дві як мінімум. Це моє
						хоббі та не даю розуму розслабитись. Я пройшла різні види навчання ,
						в різних школах та індивідуально, з україномовними вчителями та
						нейтівами. Тому я точно знаю, що таке ефективне та комфортне
						навчання. На своєму досвіді я можу сказати що вивчити мову за 2 роки
						та спілкуватися це під силу кожному, але є віковий рівень який треба
						враховувати. Програма в школі не дає гарних результатів, мало що
						змінилось з моїх часів зі слів батьків наших учнів. Тому онлайн
						курси англійської мови допоможуть вашій дитині по закінченню школи
						вільно розмовляти з однолітками з інших англомовних країн та легко
						скласти іспити в університети за кордоном. Всі наші програми
						розраховані на такий результат. Буду рада бачити ваших дітей та вас
						на курсах моєї школи.
						<br />{' '}
						<a href='#' className='block mt-5 font-semibold text-[#A032C7]'>
							Курси онлайн англійської мови для дорослих можна глянути тут.
						</a>
					</p>
					<p className='mb-5'>
						Нові знання, нові думки, нове життя… все це про вивчення англійської
						мови…
					</p>
					<p className='text-blue-500'>
						Вільного неба <span className='text-yellow-500'> нам всім!</span>
					</p>
				</div>
			),
		},
	];

	return (
		<section className='sm:pt-[90px] pt-[48px] md:pt-[138px] bg-[#FEFCFB]'>
			<div className='content'>
				<h2 className='section_title text-center mb-10 md:mb-20'>
					Загальні питання батьків про курси <br className='lg:block hidden' />{' '}
					онлайн англійської мови для дітей
				</h2>
				<span className='block h-[1px] bg-[#B5b5b5]' />
				{questions.map((q, index) => (
					<div
						key={q.id}
						className='select-none relative'
						onClick={() => toggleBlock(index)}
					>
						<div
							className={`pt-[15px] lg:pt-[30px] pb-[20px] lg:pb-[31px] border-b border-b-[#b5b5b5]`}
						>
							<h5 className='lg:text-3xl text-xl md:text-2xl xl:text-4xl max-w-[90%] sm:max-w-[90%] xl:max-w-[85%] font-bold'>
								{q.question}
							</h5>
							<svg
								xmlns='http://www.w3.org/2000/svg'
								width='24'
								height='14'
								viewBox='0 0 24 14'
								fill='none'
								className={`absolute top-[40px] right-0 s:right-2 sm:hidden block cursor-pointer duration-300 ${
									openBlocks.includes(index) ? 'rotate-180' : ''
								}`}
							>
								<path
									d='M21.8643 2L11.9319 11.9324L1.99954 2'
									stroke='#A032C7'
									strokeWidth='3'
									strokeLinecap='round'
									strokeLinejoin='round'
								/>
							</svg>
							<svg
								className={`absolute top-[35px] lg:top-[50px] right-2 sm:block hidden cursor-pointer duration-300 ${
									openBlocks.includes(index) ? 'rotate-180' : ''
								}`}
								xmlns='http://www.w3.org/2000/svg'
								width='37'
								height='21'
								viewBox='0 0 37 21'
								fill='none'
							>
								<path
									d='M34.6089 2L18.5412 18.0676L2.4736 2'
									stroke='#A032C7'
									strokeWidth='4'
									strokeLinecap='round'
									strokeLinejoin='round'
								/>
							</svg>
							<div
								className={`text-base sm:text-[22px] grid gap-6 sm:leading-[28px] lg:max-w-[80%] ${
									openBlocks.includes(index)
										? 'visible-content'
										: 'hidden-content'
								}`}
							>
								{q.answer}
							</div>
						</div>
					</div>
				))}
			</div>
		</section>
	);
};

export default Questions;
