import 'swiper/css';
import 'swiper/css/pagination';
import { Pagination } from 'swiper/modules';
import { Swiper, SwiperSlide } from 'swiper/react';

import arrows from '../../assets/reviews/arrows.svg';
import pc from '../../assets/reviews/pc.svg';
import orangeMob from '../../assets/side_vectors/orange_mob.svg';
import orange from '../../assets/side_vectors/vector_orange.svg';

const reviews_items = [
	{
		name: 'Вікторія Маркевич',
		text: 'Ми почали відвідувати онлайн школу англійської мови тільки в 10 років, i це була велика помилка, тому що я думла що шкільна програма повинна бути такою, щоб дитина заговорила, але коли я зрозуміла на одному день нарожденні, що інші діти говоярть вільно, а мій з натяжкою, то я задумалась i почала шукати курси. Я зрозуміла що ми втратили 3-4 роки, але я мала надію що він підтягне. Після тесту було пробне заняття та ми пішли в групу таких же трохи відсталих від темпу, але вже за 6 місяців прогрес був, я можу сказати великий. Тому не зволікайте, це не такі великі гроші щоб не дати дитині гарну базу на майбутне. Починайте раніше. Школу рекомендую.',
	},
	{
		name: 'Оксана Литвиненко',
		text: 'Мій старший вже пройшов два семестри а молодша донька один, звичайно ми будемо продовжувати в цій школі,тому що: по-перше системне та інтерактивне навчання, ніякої нудотини, все цікаво та матеріал підібраний до віку дитини. Методика перевернутого уроку, мене вразила, невеликі групи , 6 та 8 було дітей, я завжди можу подивитись результати моїх дітей на платформі де все що потрібно для учня та батькі в одному місці. Я зразу шукала дістанційне навчання так як ми на жаль не вдома. Матеріали школи співпадають зі шкільною з програмою, і це просто супер що так було продумано. Нам все подобається, особливо результат.',
	},
	{
		name: 'Поліна Краковець',
		text: 'Почну з того, що спочатку було важко доньці , ій 6,5 років. Саботувала, лінилась , перші труднощі і все, мма не хочу ! Я спочатку думла навіщо мучати, а потім поговорили з психологом у школі, і та дала підказку що треба допомогти пройти оцей етап. Привчити до ZOOM, подивитись який гаджет їй більше підходить, спочатку це був айпед , а потім їй сподобалось з мого макбуку 15 см, але не треба зупинятись. Я дуже рада що ми з другої спроби знайшли свою школу для навчання. Рекомендую звичайно цю школу за професіоналізм, якщо у вас виникнуть проблеми з уроками раджу не кидати , не піддаватись дитячим слабкостям, а шукати вихід і надати підтримку',
	},
	{
		name: 'Олена Швачко',
		text: 'Ми відразу шукали школу онлайн формату навчання англійській мові, це економить купу часу на дорогу, уроки завжди з дитиною, всі матеріали на професійній платформі. Ну що ще треба для комфортного навчання?) Ми не зразу залишились. в першій групі, але потім в процесі переврки знань, підібрали правильну групу, і все, в нас пішло легло, я знаю не у всіх так, нашому 8 років, але змалечку я вводила трохи англійську, тим паче що єкзамен дуже важлвий в останньому класі та і майбутне спілкування з іноземцями  теж розглядаю, мождиво навчання за кордоном, але не факт. І взаглаі, я ввжаю що українські діти повинні вільно розмовляти англійською, бо багато професій вже циього вимагає навіть в Украіні.',
	},
	{
		name: 'Валентина Мельник',
		text: 'Школу Startspeaken нам порекомендували наші друзі, подружжя яке навчається вже 2 роки. ми шукали школу для дітей та підтягнути свій рівень, ми держслужбовці. Гарні рекомендаціі та реально професійна платфоррма, підхід до навчання нам все сподобалось і ми вирішили спробувати та залишимся в цій школі, плануємо дійти до С1. Ми рекомендуємо теж цю школу.',
	},
	{
		name: 'Лідія Шевченко',
		text: 'Інтерактивній підручник який робить навчання  моєї дитини ефективним через гру- це просто супер підхід я вважаю. Атмосфера на уроці легка та невимушена. Мені подобається ще те, що я можу відслідковувати результати доньки. Дякую за такі школи в України, ми варті навчатись у кращих!',
	},
	{
		name: 'Наталія Коваленко',
		text: 'Двоє наших дітей займаються  на двох курсах Розмовний з носім та комплексний в різних групах по віковій категорії. Що хочу відмітити , що підхід по підбору групи за рівнем та віком є дуже важливим. Якщо так далі і піде то в 11 класі моя дитина буде розмовляти краще ніж я зараз , я до чого, якби я почата як моя дитина з правильної школи та програми , то вже в свої 40 мала б С1, мале в мої часи все було інакше. На сьогодні це на такі великі гроші , але великі можливості для моїх дітей.',
	},
	{
		name: 'Оксана Бондаренко ',
		text: 'Якість  навчання та продумані програми  на різну аудиторію в цій школі є головним , і я це бачу , бо зараз навчаємося  вже всією сім’єю. Інтерес до навчання дитини викликати не завжди просто , але спеціально розроблені уроки дають величезний шанс на перемогу в цьому:) ігрова форма дає можливість граючи запоминати слова , це ж чудово коли не треба заставляти щось вчити. Мої нерви спокійні.  Модель «перевернутого уроку»для мене було в новинку , але прочитавши що це використовують в багатьох школах в світі і про ефективність , і про досконалість , і про простоту , вирішила що треба спробувати. І ми зробили вірно обравши школу StartSpeakEn! Рекомендую!',
	},
	{
		name: 'Бойко Марина',
		text: 'Коли адміністрація школи попросила дати відгук , я звичайно хотіла почути враження мого сина який вже вчиться 7 місяців ,ми пройшли два семестри. Він сказав коротко але зрозуміло:) що подобається інтерактивний підручник та вчителі , не має тиску , вчиться матеріал легко. Ось таку відповідь і надаю 🙂',
	},
	{
		name: 'Ткаченко Олена',
		text: 'Не дивлячись на ситуацію нашій країні треба жити далі. тому я вирішила піти на курси англійської мови, мені підходить тільки онлайн , обирала по інтуїції та по тому що прочитала на сайті а потім вже з першої демонстрації уроку зрозуміла що вгадала. Рекомендую. ',
	},
	{
		name: 'Зозуля Катерина',
		text: 'StartSpeaken – чудова онлайн школа англійської мови. Викладачі професійні та дружні, завжди готові допомогти. Платформа зручна та проста у використанні. Особливо сподобалась гнучкість графіку – можна обирати зручний час для занять. Після курсу відчуваю значний прогрес у знанні мови. Рекомендую всім, хто хоче вивчати англійську ефективно та зручно!',
	},
	{
		name: 'Кравченко Ірина',
		text: 'StartSpeaken пропонує інтуїтивно зрозумілу та зручну платформу для навчання. Уроки структуровані таким чином, що навіть початківцям легко орієнтуватися та освоювати новий матеріал. Методика навчання базується на сучасних підходах, які ефективно поєднують теорію та практику. Мені окей! ',
	},
	{
		name: 'Коваль Марина',
		text: 'Я хочу поділитися своїм чудовим досвідом навчання в онлайн школі англійської мови StartSpeaken. Від моменту реєстрації до завершення курсу я був вражений високим рівнем професіоналізму та якістю викладання. Платформа, методика викладння6 вчітелі, підхід, все на вищому рівні!',
	},
	{
		name: 'Олійник Лілія',
		text: 'Викладачі в школі StartSpeaken – це справжні професіонали своєї справи. Вони не тільки досконало володіють англійською мовою, але й вміють доступно та цікаво пояснювати матеріал. Особливо хочеться відзначити індивідуальний підхід до кожного студента, що дозволяє максимально ефективно засвоювати знання. Точно порекомендую друзям та знайоомим.',
	},
	{
		name: 'Михайло Стадник',
		text: 'Один з найбільших плюсів StartSpeaken – це гнучкість графіку занять. Я міг самостійно обирати зручний для себе час, що дуже зручно для тих, хто має насичений робочий графік або навчається. Це дозволяє поєднувати навчання з іншими справами без шкоди для якості засвоєння матеріалу. Після завершення курсу я помітив значний прогрес у своєму володінні англійською мовою. Моє розуміння граматики покращилось, збільшився словниковий запас, а головне – я став більш впевненим у своїх мовних навичках. Я можу сказати що мій результат мені подобається.',
	},
	{
		name: 'Кухар Світлана',
		text: 'Я була приємно вражений методикою "перевернутий урок". Вивчаючи теорію вдома через відео, я міг самостійно обирати темп навчання. Це звільняло час у класі для практичних занять та обговорень з викладачем, що допомагало краще зрозуміти матеріал. Такий підхід зробив моє навчання більш ефективним та інтерактивним. Рекомендую цю методику всім, хто хоче отримувати максимальну користь від занять!',
	},
	{
		name: 'Лимар Ольга',
		text: 'Ми дуже задоволені онлайн курсом англійської мови від StartSpeaken. Наш син із захопленням відвідує заняття та робить значні успіхи у вивченні мови. Викладачі професійні та доброзичливі, завжди знаходять індивідуальний підхід до кожного учня.  Ми особливо цінуємо інноваційний підхід до викладання, це інтерративна платформа, перевернутий урок та сучасний підручник, який робить навчання цікавим та ефективним. Рекомендуємо цей курс усім батькам, які хочуть дати своїм дітям якісну освіту в сфері англійської мови!',
	},
	{
		name: 'Кравченко Марина',
		text: 'Наша улюблена школа англійської для дітей, від початку вивчення англійської до рівня В1, тепер ми всі разом. Startspeaken- це  вісокоякісний підхід до навчання, доброзичливі вчітелі які дуже уважні до дітей, тепла атмосфера та дітям весело, ну ще може бути краще за таку школу?)',
	},
	{
		name: 'Юрій Гончар',
		text: 'Зараз я навчаюсь в Startspeaken. Я хочу сказати, що я дуже радий бути тут. По-перше, заняття є дуже цікавими, і я ніколи не лінувався робити домашні завдання чи щось інше.  Мені подобається комплексність у підході, це вивчення нових слів без натіску на себе, бо нові слова плвторються не один раз в різних формах(аудіо, читання6 та вправах). Я дуже вдячний  вчителям школи, які розумно пояснюють матеріал. На уроках ми вчимося складати речення, слухаємо відео та відповідаємо на запитання, складаємо іспити тощо. Ще раз велике спасибі за те що ви є.',
	},
	{
		name: 'Гончарук Ольга',
		text: 'Закінчивши два рівні , зараз я можу спілкуватись з іноземцямі, та розуміти що від мене хочуть)) Розумію 60%  дивлячись прості фільми, головне розумію суть. Я вражена на скільки швидко продвинулась в знаннях , після школи, а мені 45 я знала тільки якісь завучені фрази які навіть сказати було тяжко, бо ніде і говорити було, а після зміни професіїї треба було трохи знати англійську, але я не зупиняюсь на досягненому!',
	},
	{
		name: 'Кухаренко Олена',
		text: 'Чула багато позитивних відгуків про цю школу, вирішила і собі спробувати. Мені дуже сподобавлась адміністртор, її витримка на купу запитань). мені підходять тільки Індивідуальні заняття англійською +урроки з нейтів. Все мені підійшло, головне бачу прогрес про який мені каже мій чоловік-британець. Тому варто спрробувати.',
	},
	{
		name: 'Ткачук Василина',
		text: 'Не знаю звідки взялась методка перевернутого уроку, але головне -це працює! Моі діти в захват від уроків, а головне не треба їх заставляти чи нагадувати, бо вони і так спокійно йдуть на ці заняття та знають свій граіфк, інколи я навіть забуваю, роблю висновок, що їм цікаво, легко та ефективно.',
	},
];

const Reviews = () => {
	return (
		<section className='bg-[#F4F5F5] pt-[44px] sm:pt-[77px] relative'>
			<img
				className='absolute sm:block hidden top-[-30px] lg:top-0 left-[-50px]'
				src={orange}
			/>
			<img src={orangeMob} className='sm:hidden block absolute top-[-20px]' />
			<div className='content flex lg:flex-row flex-col items-center justify-between gap-6 sm:gap-20'>
				<div
					data-aos='zoom-out-right'
					className='sm:grid w-full items-center flex grid-cols-2 sm:grid-cols-1 justify-between justify-items-center lg:justify-items-start'
				>
					<h2 className='sm:mb-10 mb-0 max-w-[250px] sm:max-w-[650px] text-2xl s:text-[32px] sm:text-[36px] md:text-[40px] sm:text-center xl:text-[42px] leading-[32px] s:leading-[40px] sm:leading-[52px] 2xl:text-[48px] 2xl:leading-[60px] font-bold'>
						Що кажуть про нас батьки наших учнів?
					</h2>
					<div className='flex ml-auto sm:ml-0 items-center gap-0 sm:gap-10 sm:pl-[50px]'>
						<img className='sm:block hidden' src={arrows} />
						<img className='size-[120px] sm:size-auto' src={pc} />
					</div>
				</div>
				<div className='lg:w-[50vw] w-[90vw]' data-aos='zoom-out-left'>
					<Swiper
						pagination={{
							dynamicBullets: true,
							clickable: true,
						}}
						modules={[Pagination]}
						spaceBetween={90}
						slidesPerView={1}
						loop={true}
					>
						{reviews_items.map((item, index) => {
							return (
								<SwiperSlide key={index}>
									<div className='pt-[37px] relative px-[25px] sm:px-[59px] pb-[38px] sm:pb-[55px] max-w-[857px] rounded-[20px] shadow_item bg-[#FEFCFB]'>
										<h5 className='mb-5 text-2xl sm:text-[34px] font-bold'>
											{item.name}
										</h5>
										<span className='absolute top-0 sm:right-20 right-5 reviews_span'>
											“
										</span>
										<p className='sm:text-[22px] text-sm s:text-base leading-[1.5rem] sm:leading-[28px]'>
											{item.text}
										</p>
									</div>
								</SwiperSlide>
							);
						})}
					</Swiper>
				</div>
			</div>
		</section>
	);
};

export default Reviews;
