import 'swiper/css';
import 'swiper/css/pagination';
import { Pagination, Autoplay } from 'swiper/modules';
import { Swiper, SwiperSlide } from 'swiper/react';

import arrows from '../../assets/reviews/arrows.svg';
import pc from '../../assets/reviews/pc.svg';

const reviews_items = [
	{
		name: 'Анна Борщ',
		text: `Мені 30 років, і я довго відкладала вивчення англійської мови, думаючи, що вже запізно починати. Але коли я знайшла онлайн-школу StartSpeakEn, всі мої сумніви розвіялися. З першого заняття я відчула, що тут справді знають, як навчити навіть дорослих, які починають з нуля.Заняття проходять на зручній інтерактивній платформі, де всі матеріали завжди під рукою. Викладачі чудово пояснюють, і навіть складна граматика стає зрозумілою. Що мені особливо подобається, це можливість навчатися у своєму темпі, не відчуваючи тиску. Всі уроки побудовані так, що кожен крок у навчанні приносить задоволення і впевненість.За кілька місяців я вже відчула значний прогрес: тепер можу спілкуватися англійською на базовому рівні, розумію більше текстів і навіть дивлюся серіали без перекладу. Це величезне досягнення для мене, і я вдячна StartSpeakEn за таку можливість.Рекомендую цю школу всім, хто, як і я, вирішив нарешті здійснити свою давню мрію і вивчити англійську. Повірте, ніколи не пізно починати!`,
	},
	{
		name: 'Катерина Кравченко',
		text: `Я вирішила підтягнути англійську мову, щоб знайти роботу за кордоном, і обрала онлайн-школу StartSpeakEn. Цей вибір виявився дуже вдалим! Заняття проходять у зручному форматі, що дозволяє мені поєднувати навчання з роботою. Викладачі дуже професійні та доступно пояснюють матеріал, а інтерактивна платформа робить процес навчання цікавим і ефективним.За кілька місяців навчання я відчуваю значний прогрес: моє мовлення стало більш впевненим, а словниковий запас значно зріс. Завдяки отриманим знанням я вже почала активно шукати роботу за кордоном, і тепер маю більше впевненості у своїх силах.Рекомендую StartSpeakEn всім, хто хоче поліпшити свою англійську для роботи або життя за кордоном!
`,
	},
	{
		name: 'Марина',
		text: `Я завжди мріяла жити і працювати в англомовній країні, тому вирішила серйозно зайнятися вивченням англійської. Вибрала онлайн-школу StartSpeakEn, і не могла зробити кращого вибору!Особливо хочу відзначити підручник Notes, який використовується в навчанні. Він неймовірно зручний і зрозумілий, навіть для тих, хто тільки починає вивчати мову. Усі матеріали структуровані так, що кожен урок логічно продовжує попередній, а завдання допомагають закріпити знання. Цей підручник став для мене справжнім відкриттям, оскільки поєднує в собі все необхідне для ефективного навчання.Завдяки урокам на платформі StartSpeakEn я вже відчуваю себе набагато впевненіше, коли говорю англійською. Мої знання значно покращилися, і тепер я готова до переїзду. Викладачі дійсно професіонали своєї справи, вони допомагають зрозуміти всі нюанси мови та підтримують на кожному етапі.Якщо ви, як і я, плануєте почати нове життя в англомовній країні, StartSpeakEn — це саме те, що вам потрібно! Тут ви знайдете ідеальне поєднання методики, матеріалів та підтримки.`,
	},
	{
		name: 'Олег Коваль',
		text: `Мене звати Олег Коваль, і я тільки розпочав кар’єру дизайнера. У своїй роботі часто стикаюся з англомовними замовниками, тому мені потрібно було покращити свою англійську, щоб бути більш впевненим у спілкуванні. Вирішив спробувати онлайн-школу StartSpeakEn і не пошкодував. Уроки проходять дуже зручно для мене, я можу навчатися у будь-який час, що ідеально підходить для мого розкладу. Викладачі допомогли мені значно покращити як граматику, так і розмовні навички. Я став більш впевненим у спілкуванні англійською, що вже позитивно вплинуло на мою роботу з клієнтами. Завдяки 2-м семестрам англійсьокї я відчуваю, що тепер зможу легко знайти спільну мову з будь-яким замовником, Це навчання стало для мене справжнім проривом!
`,
	},
];

const ReviewsAdult = () => {
	return (
		<section className='bg-[#F4F5F5] py-[44px] sm:py-[77px] relative'>
			<div className='content flex lg:flex-row flex-col items-center justify-between gap-6 sm:gap-20'>
				<div
					data-aos='zoom-out-right'
					className='sm:grid w-full items-center flex grid-cols-2 sm:grid-cols-1 justify-between justify-items-center lg:justify-items-start'
				>
					<h2 className='sm:mb-10 mb-0 max-w-[250px] sm:max-w-[650px] text-2xl s:text-[32px] sm:text-[36px] md:text-[40px] sm:text-center xl:text-[42px] leading-[32px] s:leading-[40px] sm:leading-[52px] 2xl:text-[48px] 2xl:leading-[60px] font-bold'>
						Що кажуть про нас учні?
					</h2>
					<div className='flex ml-auto sm:ml-0 items-center gap-0 sm:gap-10 sm:pl-[50px]'>
						<img className='sm:block hidden' src={arrows} />
						<img className='size-[120px] sm:size-auto' src={pc} />
					</div>
				</div>
				<div className='lg:w-[50vw] w-[90vw]' data-aos='zoom-out-left'>
					<Swiper
						pagination={{
							dynamicBullets: true,
							clickable: true,
						}}
						modules={[Pagination, Autoplay]}
						spaceBetween={90}
						slidesPerView={1}
						loop={true}
						autoplay={{
							delay: 5000, 
							disableOnInteraction: false,
						}}
					>
						{reviews_items.map((item, index) => {
							return (
								<SwiperSlide key={index}>
									<div className='pt-[37px] relative px-[25px] sm:px-[59px] pb-[38px] sm:pb-[55px] max-w-[857px] rounded-[20px] shadow_item bg-[#FEFCFB]'>
										<h5 className='mb-5 text-2xl sm:text-[34px] font-bold'>
											{item.name}
										</h5>
										<span className='absolute top-0 sm:right-20 right-5 reviews_span'>
											“
										</span>
										<p className='sm:text-[22px] text-sm s:text-base leading-[1.5rem] sm:leading-[28px]'>
											{item.text}
										</p>
									</div>
								</SwiperSlide>
							);
						})}
					</Swiper>
				</div>
			</div>
		</section>
	);
};

export default ReviewsAdult;
