const Career = () => {
	return (
		<section className='py-[50px] flex-1'>
			<div className='content'>
				<h2 className='section_title text-center mb-20' data-aos='fade-down'>
					{' '}
					Викладач англійської мови, ми шукаємо тебе!
				</h2>
				<p className='sm:text-2xl mb-5 sm:mb-10 text-xl font-semibold'>
					Вітаємо! Ми — Онлайн школа англійської мови StartSpeakEn. Наші
					студенти- це украінці які живуть як в Україні так і за кордоном від 6
					років.
				</p>
				<p className='sm:text-2xl mb-3 sm:mb-5 text-xl font-medium'>
					Ми шукаємо активних викладачів у свою дружню команду.
				</p>
				<p className='sm:text-2xl mb-3 sm:mb-5 text-xl font-medium'>
					Ми — сучасна онлайн школа англійської мови де всі уроки проходять на
					професійній платформі з розробленими підручниками та сценарієм уроку
					що спрощує для вчителя процес навчання.
				</p>
				<div className='mb-3 sm:mb-5'>
					<p className='sm:text-2xl text-xl mb-3'>Що ми пропонуємо?</p>
					<ul className='flex flex-col gap-3 text-lg sm:text-xl'>
						<li>- конкурентну заробітну плату</li>
						<li>- стабільне навантаження</li>
						<li>- забезпечуємо сучасним навчальним матеріалом</li>
						<li>
							- супровід та методичну підтримку від початку та на протязі всього
							співробітництва
						</li>
						<li>
							- вже є готові плани уроків на всі рівні англіської від А0-С1 та
							по всім віковим категоріям від 6 років.
						</li>
						<li>-проходження навчання на професійних курсах для вчителів.</li>
					</ul>
				</div>
				<p className='sm:text-2xl mb-3 sm:mb-5 text-xl'>
					Умови: досвід викладання бажано, але головне вимова та бажання
					викладати, тому що всі методички та уроки вже прописані. Ми всьому вас
					навчимо як користуватись платформою та проводити уроки.
				</p>
				<p className='sm:text-2xl mb-3 sm:mb-5 text-xl '>
					Можлива повна та неповна зайнятість!
				</p>
				<p className='sm:text-2xl mb-3 sm:mb-5 text-xl font-medium'>
					👉 Якщо ви готові приєднатися до нашої команди, надсилайте резюме з
					фотографією за адресою: startspeaken@ukr.net та в темі листа вкажіть -
					вакансія.
				</p>
			</div>
		</section>
	);
};

export default Career;
